In [1]:
import pandas as pd

seznam_tabulek = pd.read_html("https://ki.ujep.cz/cs/historie/",header=0)
df = seznam_tabulek[1]

                               Jméno    Od     Do Dosud na UJEP?
0         Doc. RNDr. Jan Kopka, CSc.  1987   1991             NE
1                  Ing. Zdeněk Fikar  1991   1993             NE
2             Ing. Mgr. Jiří Barilla  1993   1996            ANO
3       Doc. Ing. Prokop Toman, CSc.  1996   2001             NE
4       Ing. Mgr. Jiří Barilla, CSc.  2001   2006            ANO
5     Prof. RNDr. Ivo Nezbeda, DrSc.  2006   2008            ANO
6   Doc. RNDr. Viktor Mashkov, DrSc.  2009   2011            ANO
7  prof. RNDr. Stanislav Novák, CSc.  2011   2014            ANO
8            RNDr. Jiří Škvor, Ph.D.  2014  Dosud            ANO

In [4]:
df.head()
df.tail()

                               Jméno    Od     Do Dosud na UJEP?
4       Ing. Mgr. Jiří Barilla, CSc.  2001   2006            ANO
5     Prof. RNDr. Ivo Nezbeda, DrSc.  2006   2008            ANO
6   Doc. RNDr. Viktor Mashkov, DrSc.  2009   2011            ANO
7  prof. RNDr. Stanislav Novák, CSc.  2011   2014            ANO
8            RNDr. Jiří Škvor, Ph.D.  2014  Dosud            ANO

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Jméno           9 non-null      object
 1   Od              9 non-null      int64
 2   Do              9 non-null      object
 3   Dosud na UJEP?  9 non-null      object
dtypes: int64(1), object(3)
memory usage: 416.0+ bytes

In [6]:
df.describe()

                Od
count     9.000000
mean   2000.888889
std       9.636447
min    1987.000000
25%    1993.000000
50%    2001.000000
75%    2009.000000
max    2014.000000

In [7]:
# indexace pandas dataframů

# slovníková indexace

df["Do"] # indexujeme celý sloupec -> objekt pandas series

0     1991
1     1993
2     1996
3     2001
4     2006
5     2008
6     2011
7     2014
8    Dosud
Name: Do, dtype: object

In [8]:
df[["Do","Od"]] #výběr vícero sloupců -> výsledkem je tabulka

      Do    Od
0   1991  1987
1   1993  1991
2   1996  1993
3   2001  1996
4   2006  2001
5   2008  2006
6   2011  2009
7   2014  2011
8  Dosud  2014

In [10]:
# klasická poziční indexace
df.loc[1,"Od"]
print(df.iloc[5,0])

Prof. RNDr. Ivo Nezbeda, DrSc.

In [11]:
# indexace sloupce jako vlastnosti objektu dataframe
df.Jméno

0           Doc. RNDr. Jan Kopka, CSc.
1                    Ing. Zdeněk Fikar
2               Ing. Mgr. Jiří Barilla
3         Doc. Ing. Prokop Toman, CSc.
4         Ing. Mgr. Jiří Barilla, CSc.
5       Prof. RNDr. Ivo Nezbeda, DrSc.
6     Doc. RNDr. Viktor Mashkov, DrSc.
7    prof. RNDr. Stanislav Novák, CSc.
8              RNDr. Jiří Škvor, Ph.D.
Name: Jméno, dtype: object

In [13]:
# filtrace tabulky

df[df.Od < 2000] # df.filter()

                          Jméno    Od    Do Dosud na UJEP?
0    Doc. RNDr. Jan Kopka, CSc.  1987  1991             NE
1             Ing. Zdeněk Fikar  1991  1993             NE
2        Ing. Mgr. Jiří Barilla  1993  1996            ANO
3  Doc. Ing. Prokop Toman, CSc.  1996  2001             NE

In [16]:
# agregace dat

df.groupby("Dosud na UJEP?").count()

                Jméno  Od  Do
Dosud na UJEP?
ANO                 6   6   6
NE                  3   3   3

In [ ]:
# joiny

df.inner_join()
df.right_join()
df.left_join()
df.full_join()

In [17]:
df2= df.drop("Jméno",axis=1)
df2

     Od     Do Dosud na UJEP?
0  1987   1991             NE
1  1991   1993             NE
2  1993   1996            ANO
3  1996   2001             NE
4  2001   2006            ANO
5  2006   2008            ANO
6  2009   2011            ANO
7  2011   2014            ANO
8  2014  Dosud            ANO

In [18]:
df.drop_duplicates("Dosud na UJEP?")

                        Jméno    Od    Do Dosud na UJEP?
0  Doc. RNDr. Jan Kopka, CSc.  1987  1991             NE
2      Ing. Mgr. Jiří Barilla  1993  1996            ANO

In [ ]:
df.dropna()
df.fillna()

In [19]:
df.apply(len)

Jméno             9
Od                9
Do                9
Dosud na UJEP?    9
dtype: int64

In [2]:
# Creating dataframe a
a = pd.DataFrame()
 
# Creating Dictionary
d = {'id': [1, 2, 10, 12],
     'val1': ['a', 'b', 'c', 'd']}
 
a = pd.DataFrame(d)
 
# Creating dataframe b
b = pd.DataFrame()
 
# Creating dictionary
d = {'id': [1, 2, 9, 8],
     'val1': ['p', 'q', 'r', 's']}
b = pd.DataFrame(d)
 
# inner join
df = pd.merge(a, b, on='id', how='inner') 
# display dataframe
df

   id val1_x val1_y
0   1      a      p
1   2      b      q